{"country":"Snomedland","roadmapStart":"2022-07-01T03:00:00.000Z","roadmapEnd":"2022-12-31T00:00:00.000Z","selectedBackground":{"opSelector":"Short","text":"SNOMED CT, the world’s most comprehensive clinical terminology. With SNOMED CT, users can record patient \n      data more accurately, exchange patient data both within the health care\n      team and with patients, both locally and across borders, to improve patient outcomes. Further, stakeholders can use\n      SNOMED CT in health data and analytics platforms for clinical analytics, population analytics, management analytics,\n      clinical research, applied research, and other research activities to improve health care. <br><br>\n      To achieve the full potential of SNOMED CT in <span class='country'>COUNTRY</span>,  it must be widely implemented in well \n      designed systems. This document describes the roadmap for SNOMED CT adoption in <span class='country'>COUNTRY</span>."},"selectedVisions":[{"opSelector":"Better health","text":"- Using health information systems supported by a unified clinical terminology, in\n    all citizens of <span class='country'>COUNTRY</span>, will result in better health and improved patient\n    outcomes."},{"opSelector":"Continuity of care","text":"- Continuum of care is a concept strongly advocated by our policy. Citizen centricity, better access, universal \n    health coverage, and inclusiveness are some of our key principles. All these aspirations can be realized \n    principally by leveraging the power of using standardized clinical terminologies in digital technologies."},{"opSelector":"Better information","text":"- Standardized clinical terminologies will allow clinicians to record, share and access patient information \n    that retains the semantic fidelity (meaning) of clinical encounters. \n    Researchers and public health planners will have access to clinical information for ‘secondary uses’ with the rich detail of the clinical encounters."}],"selectedCurrentState":{"opSelector":"Add placeholder","text":"<p>The population in <span class='country'>COUNTRY</span> continues to enjoy good health and long life expectancy. This is partly due to good access to health services of high quality. Financing is based mostly on proportional social security contributions and progressive direct taxation. The compulsory health insurance is combined with a mostly private system of health care delivery, based on independent medical practice, free choice of physician, and predominantly fee-for-service payment.&nbsp;</p><p>The health system presents the evolution of the health system over the last decade, including detailed information on new policies. While no drastic reforms were undertaken during this period, policy-makers have pursued the goals of improving access to good quality of care while making the system sustainable. Reforms to increase the accessibility of the health system include measures to reduce the out-of-pocket payments of more vulnerable populations (low-income families and individuals as well as the chronically ill). Quality of care-related reforms have included incentives to better integrate different levels of care and the establishment of information systems, among others. Additionally, several measures on pharmaceutical products have aimed to reduce costs for both the National Institute for Health and Disability Insurance (NIHDI) and patients, while maintaining the quality of care.</p>"},"selectedGoals":[{"opSelector":"Standardising health record data","text":"<p>SNOMED CT will be defined as the standard for capturing data in clinical systems, including the domains of diagnosis, \n    therapeutic and diagnosis procedures, medications, immunizations, and allergies. \n    When SNOMED CT is integrated in clinical systems it allows practitioners to accurately represent clinical concepts, generating datasets \n    ready to be used in analytics, quality metrics, decision support and other use cases.\n    In the cases wehere local code systems or classifications are required for business reasons, these will be mapped with SNOMED CT, so the primary data entry \n    can be standardized to use SNOMED CT and information can be transformed into this vocabularies as necessary.</p>"},{"opSelector":"Data exchange","text":"<p>SNOMED CT will be defined as the common reference terminology for sharing data between facilities and/or healthcare providers. Information \n    exchange is the key to implement continuity of care and patient centered care. Implementation guides that combine the benefits of SNOMED CT in \n    combination with HL7 FHIR resources will ensure the transmission of information and meaning between different systems.</p>"},{"opSelector":"Clinician support","text":"<p>SNOMED CT will be defined as the standard for represeting clinical knowledge in decision support systems. \n    Clinical decision support tools link patient information to clinical knowledge, protocols or guidelines, providing alerts and advice \n    to clinicians during the care of the patient. SNOMED CT provides the adequate level of detail to encode knowledge rules conditions and actions.\n    Using a SNOMED CT it's possible to share knowledge databases and access a wide market of vendors that provide services using the standard.</p>"},{"opSelector":"Clinical research","text":"<p>Researchers will be trained to leverage SNOMED CT avantages for data analytics in clinical research. The availability of large SNOMED CT \n    encoded datasets opens many opportunities for very accurate patient selection for inclusion in clinical trials, it facilitates retrospective \n    studies, and opens the door to the realization real world evidence studies.</p>"}],"selectedClinicalFocus":[{"opSelector":"Specific healthcare sectors","text":"<p>The initial implementations will be aimed at primary care facilities.</p>"},{"opSelector":"Specialty areas","text":"<p>The General Practitioners, Cardiologists, and Gynecologists will be the initial focus for gathering requirements.</p>"},{"opSelector":"Clinical goals","text":"<p>General management of Non-Communicable Diseases, including cancer prevention.</p>"}],"selectedSteps":[{"group":"Standards and Artifacts","step":{"opSelector":"Data Models","text":"The exchange of information encoded with SNOMED CT requires sharing common data models, defined \n          by specifying minimum datasets and representation structures for the most common clinical use cases.<br>\n          The data model will be defined as HL7 FHIR resources, developing implementation guides with precise \n          terminology binding specifications for SNOMED CT.","milestones":[{"name":"Ambulatory Data Models","text":"<p>Deliver the specifications for ambulatory health records data models.</p>","date":"2022-07-15T03:00:00.000Z"},{"name":"Prescription data models","text":"<p>Deliver the specification of the prescription request data models.</p>","date":"2022-08-01T03:00:00.000Z"}]},"date":"","dateStart":"2022-07-01T03:00:00.000Z","dateEnd":"2022-08-01T03:00:00.000Z"},{"group":"Standards and Artifacts","step":{"opSelector":"Translations","text":"SNOMED CT will be translated to the local language in <span class='country'>COUNTRY</span>. \n          The translation process will be prioritized based on the requirements of the initial implementation \n          use cases, and on frequency counts of implementation experiences in other countries.","milestones":[{"name":"Priority Set Translation","text":"<p>Deliver the translation of the priority set based on the most frequent codes in the ambulatory clinics.</p>","date":"2022-08-01T03:00:00.000Z"}]},"date":"","dateStart":"2022-07-01T03:00:00.000Z","dateEnd":"2022-10-01T03:00:00.000Z"},{"group":"Standards and Artifacts","step":{"opSelector":"Value Sets","text":"Value sets or reference sets are subsets of SNOMED CT content that are applicable to an specific use case. \n          Value sets can support data entry by restricting values to an allowed set, or at the same time they can be used \n          for validation, prioritization, analytics and other use cases.<br>\n          The value sets will be generated by the National Implementation Team, and will be submitted for validation by \n          the clinical community. The resulting value sets will be distributed as reference sets in the National Edition of SNOMED CT."},"date":"","dateStart":"2022-08-01T03:00:00.000Z","dateEnd":"2022-10-01T03:00:00.000Z"},{"group":"Infrastructure","step":{"opSelector":"Shared EHR and clinical registries","text":"The National EHR infrastructure in <span class='country'>COUNTRY</span> will be adapted to include support for \n          SNOMED CT in all data entry interfaces. The data collection forms in all National Registries will be gradually adapted for \n          SNOMED CT as well, benefiting from data exchange from other clinical platforms, and with the possibility of outputting \n          datasets encoded with legacy classifications through the use of mapping."},"date":"","dateStart":"2022-08-10T03:00:00.000Z","dateEnd":"2022-11-23T03:00:00.000Z"},{"group":"Infrastructure","step":{"opSelector":"National Release Center","text":"A fundamental step in the execution of this road map includes the creation of the SNOMED National Release Center (NRC). \n          The responsibilities of the NRC include receiving the International Release of SNOMED CT from SNOMED International, making it \n          available to licensees in the Member country, and promoting and supporting adoption and deployment of SNOMED CT in \n          <span class='country'>COUNTRY</span>.<br>\n          The NRC is the primary contact point for both national Affiliates and SNOMED International, the NRC plays a central role in \n          effective and efficient collaboration with the various partners.<br>\n          The NRC will address national implementation requirements, with training strategy based on the adoption and customization of \n          training resources published by SNOMED International."},"date":"","dateStart":"2022-07-01T03:00:00.000Z","dateEnd":"2022-07-15T03:00:00.000Z"},{"group":"Infrastructure","step":{"opSelector":"National education and training services","text":"This road map will implement a National education and training strategy. The strategy will have content tailored to \n          different audiences, including clinicians, software developers, implementers, etc. The training materials will be based on \n          the International training materials, and will be adapted and expanded according to local needs.<br>\n          The process will include on-line and in-person training sessions and will implement a certification process for validating \n          the skills acquired by the students."},"date":"","dateStart":"2022-07-01T03:00:00.000Z","dateEnd":"2022-12-30T03:00:00.000Z"},{"group":"Promote Adoption","step":{"opSelector":"Onboard influencers / champions","text":"The influence of early adopters can be an important factor to spur adoption of new technologies. During the implementation \n          process champions or influencers would be identified, selecting prestigious actors that have a clear view of the benefits of \n          SNOMED CT. The implementer team will work with these champions to produce communication pieces, webinars, and exemplar implementations \n          for training material."},"date":"","dateStart":"2022-10-01T03:00:00.000Z","dateEnd":"2022-11-01T03:00:00.000Z"},{"group":"Capacity Building","step":{"opSelector":"Engage clinicians","text":"Create specific training materials oriented to clinicians, with real world clinical examples and demonstrating practical \n          healthcare benefits. It's important to consider the diversity in the clinicians activity, from primary care doctors, internists, \n          specialists, etc. An important aspect of the training is to assure that with effective implementations SNOMED CT is easy to use, \n          requires no special training and can be used even in busy care workflows.<br>\n          Clinicians can be great contributors to the implementation processes, facilitating the identification of barriers for adoption and \n          good practices."},"date":"","dateStart":"2022-10-01T03:00:00.000Z","dateEnd":"2022-11-01T03:00:00.000Z"},{"group":"Capacity Building","step":{"opSelector":"Engage software specialists","text":"Software specialists are a fundamental actor in the integration of SNOMED CT in clinical tools. They require training tailored \n          to their needs, including access to reference implementations, code examples, and open source components.<br>\n          Establishing a community of software specialists, backed in forums or social networks, can produce great benefits and accelerate the \n          onboarding of new developers."},"date":"","dateStart":"2022-09-15T03:00:00.000Z","dateEnd":"2022-10-15T03:00:00.000Z"},{"group":"Capacity Building","step":{"opSelector":"Engage with the research community","text":"The research community needs to have access to information on the benefits of using SNOMED CT encoded datasets, and to the \n          tools and techniques used for data analytics. The implementer will develop training material and organize workshops for interactive \n          demonstrations of SNOMED CT capabilities."},"date":"","dateStart":"2022-12-01T03:00:00.000Z","dateEnd":"2022-12-15T03:00:00.000Z"}],"selectedProject":{"opSelector":"Placeholder","text":"<p>A National EHR for ambulatory clinics will be developed, this project will require the adaptation of an Open Source EHR application and integration of the National Data Model and SNOMED CT terminology bindings.</p>"},"selectedClosing":{"opSelector":"Placeholder","text":"<p>The implementation of SNOMED CT will greatly increase the quality of care in <span class='country'>COUNTRY</span>, and at the same time, it will provide public health officials with accurate and up-to-date information to support decision-making.</p>"}}