{"country":"Snomedland","roadmapStart":"2022-07-01T03:00:00.000Z","roadmapEnd":"2022-12-31T00:00:00.000Z","selectedBackground":{"opSelector":"Short","text":"<p>SNOMED CT is the world’s most comprehensive clinical terminology. It enables users to record clinical \n      data more accurately, share patient data within the health care team and with patients, exchange data both locally and across borders,\n      and improve patient outcomes. Furthermore, stakeholders can use SNOMED CT to enable clinical analytics, population analytics, \n      management analytics, clinical research, applied research, and other research activities to improve health care.</p>\n      <p>To achieve its full potential in <span class='country'>COUNTRY</span>,  SNOMED CT must be widely implemented in well designed systems.\n      This document describes a roadmap for the successful adoption of SNOMED CT in <span class='country'>COUNTRY</span>.</p>"},"selectedVisions":[{"opSelector":"Better health","text":"<li>The use of a unified clinical terminology in health information systems across <span class='country'>COUNTRY</span>\n    will result in better health and improved patient outcomes for all citizens.</li>"},{"opSelector":"Continuity of care","text":"<li>Leveraging the power of standardized clinical terminology in digital technologies will allow us to realize our goals of\n      strengthening the continuity of care services across <span class='country'>COUNTRY</span> and supporting the key principles \n      of patient centricity and better access to health care for all.</li>"},{"opSelector":"Better information","text":"<li>The use of SNOMED CT in healthcare systems will allow clinicians to record, share and access patient information in a way\n    that retains the semantic fidelity (meaning) of clinical encounters. Researchers and public health planners will also be able to access\n    clinical data collected from a wide range of healthcare systems and perform meaningful queries across the rich clinical detail.</li>"}],"selectedCurrentState":{"opSelector":"Customized text","text":"<p>The population in <span class='country'>COUNTRY</span> continues to enjoy good health and long life expectancy. This is partly due to good access to health services of high quality. Financing is based mostly on proportional social security contributions and progressive direct taxation. The compulsory health insurance is combined with a mostly private system of health care delivery, based on independent medical practice, free choice of physician, and predominantly fee-for-service payment.</p><p>The health system presents the evolution of the health system over the last decade, including detailed information on new policies. While no drastic reforms were undertaken during this period, policy-makers have pursued the goals of improving access to good quality of care while making the system sustainable. Reforms to increase the accessibility of the health system include measures to reduce the out-of-pocket payments of more vulnerable populations (low-income families and individuals as well as the chronically ill). Quality of care-related reforms have included incentives to better integrate different levels of care and the establishment of information systems, among others. Additionally, several measures on pharmaceutical products have aimed to reduce costs for both the National Institute for Health and Disability Insurance (NIHDI) and patients, while maintaining the quality of care.</p>"},"selectedGoals":[{"opSelector":"Data exchange","text":"<p>SNOMED CT will be defined as the common reference terminology for sharing data between facilities and/or healthcare providers. Information \n    exchange is the key to implement continuity of care and patient centered care. Implementation guides that combine the benefits of SNOMED CT with \n    a common information model (e.g. HL7 FHIR resources) will ensure the consistent transmission of information and meaning between different systems.</p>"},{"opSelector":"Clinician support","text":"<p>SNOMED CT will be defined as the standard for representing clinical knowledge in decision support systems. \n    Clinical decision support tools link patient information to clinical knowledge, protocols or guidelines, providing alerts and advice \n    to clinicians during the care of the patient. SNOMED CT provides the level of detail needed to encode knowledge rules, conditions and actions.\n    Using SNOMED CT it's possible to share knowledge databases and access a wide market of vendors that provide services using the standard.</p>"},{"opSelector":"Clinical research","text":"<p>Researchers will be trained to leverage the power of SNOMED CT for clinical research. The availability of large SNOMED CT \n    encoded datasets opens many opportunities for very accurate patient selection for inclusion in clinical trials, it facilitates retrospective \n    studies, and opens the door to the realization of real world evidence-based studies.</p>"}],"selectedClinicalFocus":[{"opSelector":"Healthcare sectors","text":"<p>The initial implementations will be aimed at primary care facilities.</p>"},{"opSelector":"Clinical specialties","text":"<p>The General Practitioners, Cardiologists, and Gynecologists will be the initial focus for gathering requirements.</p>"},{"opSelector":"Clinical goals","text":"<p>General management of Non-Communicable Diseases, including cancer prevention.</p>"}],"selectedSteps":[{"group":"Standards and Artifacts","step":{"opSelector":"Data Models","text":"<p>Identify information model standards for recording, exchanging, integrating and analysing clinical data.\n          This step involves the following tasks:</p>\n          <ul>\n            <li>Identify data model standards to be used for each relevant clinical data functions (e.g. HL7 FHIR for \n              data exchange).</li>\n            <li>Specify minimum datasets for common clinical use cases (e.g. emergency department minimum dataset).</li>\n            <li>Create policy to establish the use of these data model standards across the healthcare sector.</li>\n          </ul>","milestones":[{"name":"Draft Data Model Specifications","text":"<p>Deliver a draft documentation of the data model</p>","date":"2022-07-18T03:00:00.000Z"},{"name":"Data Model Specification 1.0","text":"<p>Deliver the final specification for the data model</p>","date":"2022-07-29T03:00:00.000Z"}]},"date":"","dateStart":"2022-07-01T03:00:00.000Z","dateEnd":"2022-07-31T03:00:00.000Z"},{"group":"Standards and Artifacts","step":{"opSelector":"Terminology Binding","text":"<p>Bind information models to SNOMED CT and other relevant code systems. This step involves the following tasks:</p>\n          <ul>\n            <li>Identify the code system to be used for each coded data element in each information model.</li>\n            <li>Define the value set that may be used to populate each coded data element, either using a computable query (intensionally) \n            or by defining a fixed list of concept identifiers (extensionally).</li>\n            <li> Develop an implementation guide that specifies the terminology binding for each coded data element. \n            Note: This implementation guidance can be used by developers to restrict the values a user is allowed to enter into\n            a specific data field, for validation of exchanged messages, for data analytics, and many other use cases.</li>\n          </ul>"},"date":"","dateStart":"2022-07-24T03:00:00.000Z","dateEnd":"2022-08-19T03:00:00.000Z"},{"group":"Standards and Artifacts","step":{"opSelector":"Translation","text":"<p>Translate SNOMED CT into the local language dialect(s) spoken in <span class='country'>COUNTRY</span>.\n          This step involves the following tasks:</p>\n          <ul>\n            <li>Prioritise the SNOMED CT subhierarchies and value sets requiring translation, based on implementation use cases\n            and predicted frequency of use (frequency data can be gathered from experience in other countries).</li>\n            <li>Define the translation process, including appropriate tooling and review processes.</li>\n            <li>Identify suitable translation resources, with appropriate language and terminology skills (note: SNOMED CT training \n              should be offered to translators with no prior SNOMED CT experience).</li>\n            <li>Perform translation and review process based on identified priorities.</li>\n            <li>Distribute and/or deploy translations (e.g. via a terminology server or RF2 files).</li>\n          </ul>"},"date":"","dateStart":"2022-07-17T03:00:00.000Z","dateEnd":"2022-10-31T03:00:00.000Z"},{"group":"Infrastructure","step":{"opSelector":"National Release Center","text":"<p>Create the SNOMED National Release Center (NRC) for <span class='country'>COUNTRY</span>. \n          The responsibilities of the NRC include receiving the International Release of SNOMED CT from SNOMED International, making it \n          available to licensees in the Member country, and promoting and supporting adoption and deployment of SNOMED CT in \n          <span class='country'>COUNTRY</span>.</p>\n          <p>The NRC is the primary contact point for both national Affiliates and SNOMED International, the NRC plays a central role in \n          effective and efficient collaboration with the various partners.<br>\n          The NRC will address national implementation requirements, with training strategy based on the adoption and customization of \n          training resources published by SNOMED International.</p>","milestones":[{"name":"Hire NRC Team","text":"","date":"2022-07-01T03:00:00.000Z"},{"name":"Define scope","text":"","date":"2022-07-04T19:18:44.738Z"},{"name":"Start training","text":"","date":"2022-07-11T03:00:00.000Z"}]},"date":"","dateStart":"2022-07-01T03:00:00.000Z","dateEnd":"2022-07-15T03:00:00.000Z"},{"group":"Infrastructure","step":{"opSelector":"National education and training services","text":"<p>Implement a National education and training strategy. The strategy will have content tailored to \n          different audiences, including clinicians, software developers, implementers, etc. The training materials will be based on \n          the International training materials, and will be adapted and expanded according to local needs.</p>\n          <p>The process will include on-line and in-person training sessions and will implement a certification process for validating \n          the skills acquired by the students.</p>"},"date":"","dateStart":"2022-09-01T03:00:00.000Z","dateEnd":"2022-11-30T03:00:00.000Z"},{"group":"Promote Adoption","step":{"opSelector":"Onboard influencers / champions","text":"<p>Contact early adopters to generate examples of successful implementations. During the implementation \n          process champions or influencers would be identified, selecting prestigious actors that have a clear view of the benefits of \n          SNOMED CT. The implementer team will work with these champions to produce communication pieces, webinars, and exemplar implementations \n          for training material.</p>"},"date":"","dateStart":"2022-09-01T03:00:00.000Z","dateEnd":"2022-09-30T03:00:00.000Z"},{"group":"Capacity Building","step":{"opSelector":"Engage clinicians","text":"<p>Create specific training materials oriented to clinicians, with real world clinical examples and demonstrating practical \n          healthcare benefits. It's important to consider the diversity in the clinicians activity, from primary care doctors, internists, \n          specialists, etc. An important aspect of the training is to assure that with effective implementations SNOMED CT is easy to use, \n          requires no special training and can be used even in busy care workflows.</p>\n          <p>Clinicians can be great contributors to the implementation processes, facilitating the identification of barriers for adoption and \n          good practices.</p>"},"date":"","dateStart":"2022-09-01T03:00:00.000Z","dateEnd":"2022-09-30T03:00:00.000Z"},{"group":"Capacity Building","step":{"opSelector":"Engage software specialists","text":"<p>Establish a community of software specialists, backed in forums or social networks, with the goal of accelerating the \n          onboarding of new developers and ensure the best possible quality of implementations.</p>\n          <p>Software specialists are a fundamental actor in the integration of SNOMED CT in clinical tools. They require training tailored \n          to their needs, including access to reference implementations, code examples, and open source components.</p>"},"date":"","dateStart":"2022-10-03T03:00:00.000Z","dateEnd":"2022-10-31T03:00:00.000Z"},{"group":"Capacity Building","step":{"opSelector":"Engage with the research community","text":"<p>Develop training material and organize workshops for interactive demonstrations of SNOMED CT capabilities for \n          analytics and research.</p>\n          <p>The research community needs to have access to information on the benefits of using SNOMED CT encoded datasets, and to the \n          tools and techniques used for data analytics.</p>"},"date":"","dateStart":"2022-10-03T03:00:00.000Z","dateEnd":"2022-10-31T03:00:00.000Z"}],"selectedProject":{"opSelector":"Customized text","text":"<p>A National EHR for ambulatory clinics will be developed, this project will require the adaptation of an Open Source EHR application and integration of the National Data Model and SNOMED CT terminology bindings.</p>"},"selectedClosing":{"opSelector":"Long","text":"<p>SNOMED CT, the world's most comprehensive clinical terminology, has many potential benefits for the healthcare sector \n        in <span class='country'>COUNTRY</span>. It enables clinicians to record patient data more accurately and share this data with \n        other healthcare providers in a meaningful way to improve patient outcomes, it enables systems to integrate more effectively\n        with clinical decision support knowledge bases, and it enables clinical data to be integrated from disparate systems\n        for clinical analytics, population health management and clinical research.</p>\n        <p>SNOMED CT will be implemented at different levels of the health system, including its integration with clinical records, \n        national registries, analytics and reporting. It will be introduced as a requirement in data exchange models and \n        implementation guides. This should be a coordinated effort that includes the clinicians, software developers, public health \n        officials and technical interoperability architects, among others.</p>\n        <p>Through the implementation of SNOMED CT following this roadmap, <span class='country'>COUNTRY</span> can achieve \n        these benefits and deliver on our eHealth goals.</p>"}}